-- phpMyAdmin SQL Dump
-- version 4.4.15.10
-- https://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2022-12-15 03:07:34
-- 服务器版本： 8.0.24
-- PHP Version: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mybatis`
--

-- --------------------------------------------------------

--
-- 表的结构 `card`
--

CREATE TABLE IF NOT EXISTS `card` (
  `ability1` int DEFAULT NULL,
  `ability2` int DEFAULT NULL,
  `ability3` int DEFAULT NULL,
  `ability4` int DEFAULT NULL,
  `ability5` int DEFAULT NULL,
  `cardLevel` int DEFAULT NULL,
  `experience` int DEFAULT NULL,
  `rank` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `cardName` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `introduction` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `preferance` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `card`
--

INSERT INTO `card` (`ability1`, `ability2`, `ability3`, `ability4`, `ability5`, `cardLevel`, `experience`, `rank`, `cardName`, `introduction`, `preferance`) VALUES
(6, 7, 6, 5, 6, 1, 0, '副教授', '严锴', '研究方向:算子理论与算子代数,线性算子谱理论与广义逆理论,算子空间、算子系统及相关的量子信息理论。', '算子理论'),
(4, 6, 4, 5, 6, 1, 0, '讲师', '刘宝谨', '主要研究电力电子与电力传动,基于分布式多变流器的微电网控制技术,可再生能源并网,储能变流器.', '微电网控制，电子电力'),
(6, 5, 6, 6, 7, 1, 0, '副教授', '刘耿耿', '博士生导师,旗山学者,福建省高层次人才,福州大学计算机与大数据学院院长助理,福建省网络计算与智能信息处理重点实验室副主任。', '大数据计算，智能信息处理'),
(5, 6, 4, 5, 5, 1, 0, '讲师', '刘金艳', '主讲课程:生物冶金基础、选矿测试技术训练。', '生物治金，选矿'),
(6, 8, 6, 7, 8, 1, 0, '教授', '卢钟磊', '研究方向:肿瘤生物学、细胞周期调控与信号转导。首次发现E2F1从“促增殖”向“促凋亡”转变的分子开关Skp2,并阐明其作用机制。', '肿瘤生物学'),
(6, 6, 6, 5, 7, 1, 0, '副教授', '叶晓丹', '研究方向:经济法学、环境法学、税法学、金融法学。', '经济法学，环境法学'),
(6, 5, 7, 7, 5, 1, 0, '副教授', '吕源财', '研究方向:环境友好材料的研发和应用,水污染控制化学,纳米材料的环境风险。', '环境与安全工程学院'),
(6, 5, 4, 4, 6, 1, 0, '讲师', '吕鹏', '具备十几年的教学经验,主要授课课程:《药物生物技术》、《免疫学》和《病原微生物和免疫学》等。', '生物科学与工程学院'),
(7, 8, 7, 6, 7, 1, 0, '教授', '吴波', '多尺度集成计算材料工程,金属材料和无机功能材料的微结构、相变和性能研究，特种加工过程模拟仿真,特种新材料开发。研究课题选题广泛,开放包容性强。', '材料科学与工程学院'),
(5, 5, 5, 5, 5, 1, 0, '副教授', '壮年的栋哥', '一个很帅的老师', '软件工程'),
(5, 5, 5, 5, 5, 1, 0, '讲师', '天才栋哥', '一个很帅的老师', '软件工程'),
(5, 5, 5, 6, 4, 1, 0, '讲师', '常卫杰', '研究领域:集成光电子技术与器件研究,光子器件智能优化与逆向设计。', '机械工程及自动化学院'),
(5, 5, 5, 5, 5, 1, 0, '讲师', '年轻的栋哥', '一个很帅的老师', '软件工程'),
(5, 7, 5, 6, 7, 1, 0, '副教授', '张文慧', '主讲本科生《地球化学》、《同位素地球化学》及研究生《岩石矿床地球化学》等课程,承担永安地质教学实习课程。', '紫金地质与矿业学院'),
(7, 8, 7, 5, 8, 1, 0, '教授', '张旭东', '福建省法学会行为法学研究会会长,中国民事诉讼法学研究会理事,福建省诉讼法学研究会常务理事。', '法学院'),
(5, 5, 5, 5, 5, 1, 0, '教授', '张栋', '一个很帅的老师', '软件工程'),
(6, 8, 6, 7, 8, 1, 0, '教授', '张鹰', '主要研究方向:城市设计理论与方法、城镇历史文化街区保护、乡村传统聚落保护与再生、传统建筑修缮技艺研究等。', '建筑与城乡规划学院'),
(4, 6, 4, 5, 6, 1, 0, '讲师', '晏全香', '研究方向:选矿工艺,矿物材料,非金属深加工,资源综合利用。', '紫金地质与矿业学院'),
(6, 6, 4, 5, 4, 1, 0, '讲师', '朱振山', '主要研究电力系统运行与控制,电力系统规划、人工智能在电力系统中的应用、储能等。', '电气工程'),
(5, 6, 5, 4, 6, 1, 0, '讲师', '李年清', '研究方向:行政诉讼、私人行政、规制与治理。', '法学院'),
(5, 7, 4, 5, 4, 1, 0, '讲师', '杨晶菁', '主要研究方向包括电力电子功率变换技术、无线电能传输技术等。在国内外著名学术刊物和国际会议发表论文10篇。', '电气工程'),
(5, 5, 5, 5, 5, 1, 0, '讲师', '林木森', '主讲“普通地质学”、“区域地质学”、“高级岩石学”、“地质认识实习”等课程。', '紫金地质与矿业学院'),
(7, 5, 5, 6, 7, 1, 0, '副教授', '林枞', '研究方向:功能陶瓷、陶瓷先进成型与烧结技术、材料高通量制备。', '材料科学与工程学院'),
(6, 7, 7, 5, 5, 1, 0, '副教授', '林海英', '具备十几年的教学经验,主要授课课程:《药物生物技术》、《免疫学》和《病原微生物和免疫学》等。', '生物科学与工程学院'),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋2', '一个很帅的老师', '软件工程'),
(5, 5, 5, 5, 4, 1, 0, '教授', '栋哥', '一个很帅的老师', '软件工程'),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋大哥', '一个很帅的老师', '软件工程'),
(6, 5, 6, 4, 4, 1, 0, '讲师', '檀彦超', '研究兴趣包括推荐系统、智慧医疗、数据挖掘、人工智能、机器学习等。曾在KDD、SIGIR、ICDE等CCF A类会议上发表了多篇学术论文。', '计算机与大数据学院'),
(7, 7, 6, 7, 8, 1, 0, '教授', '毛景文', '现任自然资源部成矿作用和资源评价重点实验室主任。兼任中国地质学会理事及矿床专业委员会主任,中国矿物岩石地球化学学会常务理事。', '紫金地质与矿业学院'),
(7, 8, 6, 4, 5, 1, 0, '副教授', '毛行奎', '研究领域包括电力电子电磁技术、电磁干扰诊断与抑制、功率变换技术,无线电能传输以及可再生能源发电等技术。', '电气工程'),
(6, 5, 6, 7, 6, 1, 0, '副教授', '洪艳梅', '主要研究领域为图论及其应用,组合最优化。主要包括结构图论,图算法,优化方面的理论和应用研究。', '数学与统计学院'),
(5, 5, 4, 5, 6, 1, 0, '讲师', '温娜', '研究方向:共价有机框架材料的设计、合成及光,自愈性水凝胶的生物医学工程应用等。', '材料科学与工程学院'),
(5, 5, 5, 6, 4, 1, 0, '讲师', '王大彪', '研究方向:超临界流体在强化管内的对流换热,有机朗肯循环动力系统设计。', '机械工程及自动化学院'),
(5, 4, 6, 5, 5, 1, 0, '讲师', '王平', '目前从事代数方向研究,主讲课程:高等数学,线性代数等。', '数学与统计学院'),
(5, 5, 5, 6, 4, 1, 0, '讲师', '王成勇', '主要从事水泥及混凝土等建筑材料的相关科研:包括混凝土外加剂、干混砂浆、新型墙体材料、废旧混凝土等建筑废料的开发利用。', '材料科学与工程学院'),
(6, 4, 5, 4, 6, 1, 0, '讲师', '王才伟', '研究证券法,主持2019年《融资性贸易的识别与风险防范》横向课题。', '法学院'),
(5, 5, 5, 5, 5, 1, 0, '讲师', '王鹏', '主要从事切换系统控制、正系统的性能分析与综合、人工神经网络、动力系统的稳定性分析与控制等领域的研究。', '数学与统计学院'),
(6, 5, 4, 4, 6, 1, 0, '讲师', '翁谦', '主讲课程:数字逻辑与电路设计,研究方向:遥感图像分析,机器学习,以及时空数据智能处理。', '计算机与大数据学院'),
(6, 6, 5, 6, 7, 1, 0, '副教授', '肖爱芳', '主讲《地质制图》、《资源信息工程》、《地质制图课程设计》、《资源信息工程课程设计》、《数字矿山》等课程。', '紫金地质与矿业学院'),
(6, 5, 7, 7, 5, 1, 0, '副教授', '肖蓉', '研究方向:退化盐沼湿地淡水补水修复的土壤响应机理,污染物在湿地土壤中的迁移转化机制及污染生态风险评价。', '环境与安全工程学院'),
(8, 7, 6, 8, 6, 1, 0, '教授', '花为', '国家杰青、优青获得者,入选教育部青年长江学者、科技部中青年科技创新领军人才、中组部万人计划科技创新领军人才。', '电气工程'),
(6, 7, 7, 6, 4, 1, 0, '副教授', '萨百晟', '研究方向:基于材料基因工程的材料多尺度集成模拟与设计、密度泛函理论材料自动流程计算、机器学习材料性质预测。', '材料科学与工程学院'),
(5, 6, 5, 5, 4, 1, 0, '讲师', '蔡芫镔', '主讲课程:城市生态学、环境规划与管理、景观生态学及其应用、环境水文学。', '环境与安全工程学院'),
(6, 5, 6, 4, 4, 1, 0, '讲师', '蔡道平', '主要从事电化学储能材料与器件相关领域的研究,包括超级电容器,锂钠离子电池以及水系二次电池等。', '材料科学与工程学院'),
(4, 6, 4, 5, 6, 1, 0, '讲师', '薛林', '主要研究方向:乡土文化景观研究，景观美学。', '建筑与城乡规划学院'),
(6, 7, 5, 5, 7, 1, 0, '副教授', '邓丽萍', '研究方向:金属材料结构设计及组织性能分析,金属材料强韧化机理研究。', '机械工程及自动化学院'),
(7, 7, 5, 6, 5, 1, 0, '副教授', '郑昕', '主要研究方向为电器及其智能化技术、开关电弧与等离子体。作为项目负责人,承担了福建省自然科学基金和福建省教育厅等多项省市级科技项目。', '电气工程'),
(4, 6, 4, 5, 6, 1, 0, '讲师', '郑琦珊', '主要研究方向:校园建筑设计、公共建筑设计及其更新改造研究、保障性住房设计及其适老化改造研究、建筑设计教学改革。', '建筑与城乡规划学院'),
(7, 6, 7, 7, 8, 1, 0, '教授', '郭昆', '数字福建大数据基础技术福州研究院副院长,中国计算机学会CCF高级会员,CCF协同计算专委会委员,CCF大数据专委会委员。', '计算机与大数据学院'),
(5, 6, 5, 5, 4, 1, 0, '讲师', '郭杰', '主要研究方向为水污染控制工程。讲授课程:《环境资源与可持续发展》《水污染控制工程》。', '环境与安全工程学院'),
(7, 7, 6, 8, 7, 1, 0, '教授', '郭龙坤', '主要研究领域为数据科学与计算机网络。致力于计算机网络、数据科学、数据挖掘与隐私保护、并行与分布式计算等领域。', '数学与统计学院'),
(6, 7, 6, 4, 7, 1, 0, '副教授', '陆文彬', '研究方向:民商法学、经济法学、环境与资源保护法学。。', '法学院'),
(5, 5, 5, 6, 4, 1, 0, '讲师', '陈丽琼', '研究领域:计算机视觉,光学遥感图像舰船检测,红外小目标检测。', '机械工程及自动化学院'),
(5, 5, 5, 4, 6, 1, 0, '讲师', '陈哲毅', '福建省网络计算与智能信息处理重点实验室副主任,主要研究方向包括云/边缘计算、资源优化、深度学习、强化学习等。', '计算机与大数据学院'),
(7, 8, 6, 6, 8, 1, 0, '教授', '陈学明', '研究方向:污水生物处理水处理,工艺的数学模拟,新型微生物脱氮工艺,污水处理工艺的温室气体排放及减排,生物膜工艺', '环境与安全工程学院'),
(6, 7, 5, 5, 7, 1, 0, '副教授', '陈彦杰', '研究方向:运动规划、路径规划,机器人运动学和动力学,智能控制方法,智能优化方法。', '机械工程及自动化学院'),
(7, 8, 6, 6, 8, 1, 0, '教授', '陈德为', '中国农工民主党福州大学第三支部主委。研究领域:电机与电器,电气自动化,机电一体化。', '机械工程及自动化学院'),
(6, 7, 7, 5, 5, 1, 0, '副教授', '陈文锋', '参与承担研究生课程《细胞生物学》、《细胞与基因工程》、《细胞信号转导》、本科生《生物化学实验》教学。', '生物科学与工程学院'),
(7, 5, 5, 6, 7, 1, 0, '副教授', '陈道也', '中国计算机学会CCF会员,中国地理学会GSC会员,美国哈佛大学兼职研究员Research Associate。', '计算机与大数据学院'),
(4, 6, 4, 5, 6, 1, 0, '讲师', '隋晓栋', '主要研究方向:油画,水彩,美术史论。', '建筑与城乡规划学院'),
(5, 5, 6, 4, 6, 1, 0, '讲师', '韩京京', '研究方向:民法、比较法、法国法。', '法学院'),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马妍', '主要研究方向:以资源环境为切入点,以计算机技术和城市模拟为基础,遵循驱动要素-个体行为-空间格局变化-空间管理的研究思路。', '建筑与城乡规划学院'),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马非', '主要研究方向:公共建筑设计。科研项目:武夷山茶博物馆,福建武夷山。', '建筑与城乡规划学院'),
(5, 6, 5, 5, 4, 1, 0, '讲师', '黄健', '主要从事固体废物管理、处理及资源化、清洁生产等方向教学及研究工作。', '环境与安全工程学院'),
(5, 5, 6, 4, 5, 1, 0, '讲师', '黄寿颖', '主讲课程:高等数学、数学建模、线性代数。研究生物数学。', '数学与统计学院'),
(6, 5, 4, 4, 6, 1, 0, '讲师', '黄达', '主要从事生物医用材料的设计、制备及应用研究。研究生课程:《功能性食品评价基本原理和方法》。', '生物科学与工程学院');

-- --------------------------------------------------------

--
-- 表的结构 `personalcard`
--

CREATE TABLE IF NOT EXISTS `personalcard` (
  `ability1` int DEFAULT NULL,
  `ability2` int DEFAULT NULL,
  `ability3` int DEFAULT NULL,
  `ability4` int DEFAULT NULL,
  `ability5` int DEFAULT NULL,
  `cardLevel` int DEFAULT NULL,
  `experience` int DEFAULT NULL,
  `rank` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `cardName` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `introduction` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `preferance` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `situation` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `UID` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `dateTime` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `duplicateCards` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `personalcard`
--

INSERT INTO `personalcard` (`ability1`, `ability2`, `ability3`, `ability4`, `ability5`, `cardLevel`, `experience`, `rank`, `cardName`, `introduction`, `preferance`, `situation`, `UID`, `dateTime`, `duplicateCards`) VALUES
(6, 5, 6, 6, 7, 1, 0, '副教授', '刘耿耿', '博士生导师,旗山学者,福建省高层次人才,福州大学计算机与大数据学院院长助理,福建省网络计算与智能信息处理重点实验室副主任。', '大数据计算，智能信息处理', '出战', '032002', '', 2),
(6, 8, 6, 7, 8, 1, 0, '教授', '卢钟磊', '研究方向:肿瘤生物学、细胞周期调控与信号转导。首次发现E2F1从“促增殖”向“促凋亡”转变的分子开关Skp2,并阐明其作用机制。', '肿瘤生物学', '出战', '032002', '', 7),
(6, 6, 6, 5, 7, 1, 0, '副教授', '叶晓丹', '研究方向:经济法学、环境法学、税法学、金融法学。', '经济法学，环境法学', '出战', '032002', '', 1),
(6, 5, 7, 7, 5, 1, 0, '副教授', '吕源财', '研究方向:环境友好材料的研发和应用,水污染控制化学,纳米材料的环境风险。', '环境与安全工程学院', '出战', '032002', '', 1),
(7, 8, 7, 6, 7, 1, 0, '教授', '吴波', '多尺度集成计算材料工程,金属材料和无机功能材料的微结构、相变和性能研究，特种加工过程模拟仿真,特种新材料开发。研究课题选题广泛,开放包容性强。', '材料科学与工程学院', '闲置', '032002', '', 7),
(7, 8, 7, 5, 8, 1, 0, '教授', '张旭东', '福建省法学会行为法学研究会会长,中国民事诉讼法学研究会理事,福建省诉讼法学研究会常务理事。', '法学院', '闲置', '032002', '', 10),
(5, 5, 5, 5, 5, 1, 0, '教授', '张栋', '一个很帅的老师', '软件工程', '闲置', '032002', '', 8),
(6, 8, 6, 7, 8, 1, 0, '教授', '张鹰', '主要研究方向:城市设计理论与方法、城镇历史文化街区保护、乡村传统聚落保护与再生、传统建筑修缮技艺研究等。', '建筑与城乡规划学院', '闲置', '032002', '', 3),
(7, 5, 5, 6, 7, 1, 0, '副教授', '林枞', '研究方向:功能陶瓷、陶瓷先进成型与烧结技术、材料高通量制备。', '材料科学与工程学院', '闲置', '032002', '', 1),
(6, 7, 7, 5, 5, 1, 0, '副教授', '林海英', '具备十几年的教学经验,主要授课课程:《药物生物技术》、《免疫学》和《病原微生物和免疫学》等。', '生物科学与工程学院', '闲置', '032002', '', 1),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋2', '一个很帅的老师', '软件工程', '闲置', '032002', '', 8),
(5, 5, 5, 5, 4, 1, 0, '教授', '栋哥', '一个很帅的老师', '软件工程', '闲置', '032002', '', 6),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋大哥', '一个很帅的老师', '软件工程', '闲置', '032002', '', 6),
(7, 7, 6, 7, 8, 1, 0, '教授', '毛景文', '现任自然资源部成矿作用和资源评价重点实验室主任。兼任中国地质学会理事及矿床专业委员会主任,中国矿物岩石地球化学学会常务理事。', '紫金地质与矿业学院', '闲置', '032002', '', 10),
(7, 8, 6, 4, 5, 1, 0, '副教授', '毛行奎', '研究领域包括电力电子电磁技术、电磁干扰诊断与抑制、功率变换技术,无线电能传输以及可再生能源发电等技术。', '电气工程', '闲置', '032002', '', 1),
(6, 5, 6, 7, 6, 1, 0, '副教授', '洪艳梅', '主要研究领域为图论及其应用,组合最优化。主要包括结构图论,图算法,优化方面的理论和应用研究。', '数学与统计学院', '闲置', '032002', '', 2),
(6, 6, 5, 6, 7, 1, 0, '副教授', '肖爱芳', '主讲《地质制图》、《资源信息工程》、《地质制图课程设计》、《资源信息工程课程设计》、《数字矿山》等课程。', '紫金地质与矿业学院', '闲置', '032002', '', 3),
(6, 5, 7, 7, 5, 1, 0, '副教授', '肖蓉', '研究方向:退化盐沼湿地淡水补水修复的土壤响应机理,污染物在湿地土壤中的迁移转化机制及污染生态风险评价。', '环境与安全工程学院', '闲置', '032002', '', 1),
(8, 7, 6, 8, 6, 1, 0, '教授', '花为', '国家杰青、优青获得者,入选教育部青年长江学者、科技部中青年科技创新领军人才、中组部万人计划科技创新领军人才。', '电气工程', '闲置', '032002', '', 7),
(6, 7, 7, 6, 4, 1, 0, '副教授', '萨百晟', '研究方向:基于材料基因工程的材料多尺度集成模拟与设计、密度泛函理论材料自动流程计算、机器学习材料性质预测。', '材料科学与工程学院', '闲置', '032002', '', 1),
(7, 6, 7, 7, 8, 1, 0, '教授', '郭昆', '数字福建大数据基础技术福州研究院副院长,中国计算机学会CCF高级会员,CCF协同计算专委会委员,CCF大数据专委会委员。', '计算机与大数据学院', '闲置', '032002', '', 5),
(7, 7, 6, 8, 7, 1, 0, '教授', '郭龙坤', '主要研究领域为数据科学与计算机网络。致力于计算机网络、数据科学、数据挖掘与隐私保护、并行与分布式计算等领域。', '数学与统计学院', '闲置', '032002', '', 11),
(6, 7, 6, 4, 7, 1, 0, '副教授', '陆文彬', '研究方向:民商法学、经济法学、环境与资源保护法学。。', '法学院', '闲置', '032002', '', 1),
(7, 8, 6, 6, 8, 1, 0, '教授', '陈学明', '研究方向:污水生物处理水处理,工艺的数学模拟,新型微生物脱氮工艺,污水处理工艺的温室气体排放及减排,生物膜工艺', '环境与安全工程学院', '闲置', '032002', '', 5),
(6, 7, 5, 5, 7, 1, 0, '副教授', '陈彦杰', '研究方向:运动规划、路径规划,机器人运动学和动力学,智能控制方法,智能优化方法。', '机械工程及自动化学院', '闲置', '032002', '', 2),
(7, 8, 6, 6, 8, 1, 0, '教授', '陈德为', '中国农工民主党福州大学第三支部主委。研究领域:电机与电器,电气自动化,机电一体化。', '机械工程及自动化学院', '闲置', '032002', '', 4),
(6, 7, 7, 5, 5, 1, 0, '副教授', '陈文锋', '参与承担研究生课程《细胞生物学》、《细胞与基因工程》、《细胞信号转导》、本科生《生物化学实验》教学。', '生物科学与工程学院', '闲置', '032002', '', 1),
(34, 30, 30, 28, 33, 2, 1999747, '院士', '刘耿耿', '博士生导师,旗山学者,福建省高层次人才,福州大学计算机与大数据学院院长助理,福建省网络计算与智能信息处理重点实验室副主任。', '大数据计算，智能信息处理', '教学', '123456', '1670914221048', 2),
(20, 22, 20, 21, 22, 1, 200043, '教授', '张文慧', '主讲本科生《地球化学》、《同位素地球化学》及研究生《岩石矿床地球化学》等课程,承担永安地质教学实习课程。', '紫金地质与矿业学院', '出战', '123456', '1670296771198', 2),
(24, 22, 23, 19, 25, 4, 460018, '讲师', '李年清', '研究方向:行政诉讼、私人行政、规制与治理。', '法学院', '闲置', '123456', '1670680695480', 1),
(47, 52, 50, 55, 51, 3, 200, '院士', '洪艳梅', '主要研究领域为图论及其应用,组合最优化。主要包括结构图论,图算法,优化方面的理论和应用研究。', '数学与统计学院', '闲置', '123456', '1669965112033', 0),
(5, 4, 6, 5, 5, 1, 3500, '讲师', '王平', '目前从事代数方向研究,主讲课程:高等数学,线性代数等。', '数学与统计学院', '闲置', '123456', '1669965153096', 1),
(13, 15, 14, 23, 10, 6, 1000018, '讲师', '王成勇', '主要从事水泥及混凝土等建筑材料的相关科研:包括混凝土外加剂、干混砂浆、新型墙体材料、废旧混凝土等建筑废料的开发利用。', '材料科学与工程学院', '运动', '123456', '1670680645259', 1),
(6, 6, 5, 6, 7, 1, 500, '副教授', '肖爱芳', '主讲《地质制图》、《资源信息工程》、《地质制图课程设计》、《资源信息工程课程设计》、《数字矿山》等课程。', '紫金地质与矿业学院', '闲置', '123456', '', 11),
(21, 20, 22, 22, 20, 1, 0, '教授', '肖蓉', '研究方向:退化盐沼湿地淡水补水修复的土壤响应机理,污染物在湿地土壤中的迁移转化机制及污染生态风险评价。', '环境与安全工程学院', '闲置', '123456', '1669968257500', 4),
(23, 27, 24, 23, 23, 2, 300, '教授', '萨百晟', '研究方向:基于材料基因工程的材料多尺度集成模拟与设计、密度泛函理论材料自动流程计算、机器学习材料性质预测。', '材料科学与工程学院', '教学', '123456', '1670920264752', 5),
(7, 7, 5, 6, 5, 1, 0, '副教授', '郑昕', '主要研究方向为电器及其智能化技术、开关电弧与等离子体。作为项目负责人,承担了福建省自然科学基金和福建省教育厅等多项省市级科技项目。', '电气工程', '教学', '123456', '', 10),
(4, 6, 4, 5, 6, 1, 0, '讲师', '郑琦珊', '主要研究方向:校园建筑设计、公共建筑设计及其更新改造研究、保障性住房设计及其适老化改造研究、建筑设计教学改革。', '建筑与城乡规划学院', '闲置', '123456', '', 1),
(6, 7, 6, 4, 7, 1, 0, '副教授', '陆文彬', '研究方向:民商法学、经济法学、环境与资源保护法学。。', '法学院', '出战', '123456', '', 9),
(6, 7, 5, 5, 7, 1, 0, '副教授', '陈彦杰', '研究方向:运动规划、路径规划,机器人运动学和动力学,智能控制方法,智能优化方法。', '机械工程及自动化学院', '闲置', '123456', '', 10),
(7, 8, 6, 6, 8, 1, 0, '教授', '陈德为', '中国农工民主党福州大学第三支部主委。研究领域:电机与电器,电气自动化,机电一体化。', '机械工程及自动化学院', '出战', '123456', '', 1),
(7, 5, 5, 6, 7, 1, 500, '副教授', '陈道也', '中国计算机学会CCF会员,中国地理学会GSC会员,美国哈佛大学兼职研究员Research Associate。', '计算机与大数据学院', '闲置', '123456', '', 5),
(5, 5, 6, 4, 6, 1, 0, '讲师', '韩京京', '研究方向:民法、比较法、法国法。', '法学院', '教学', '123456', '1669965197178', 1),
(6, 5, 4, 4, 6, 1, 0, '讲师', '黄达', '主要从事生物医用材料的设计、制备及应用研究。研究生课程:《功能性食品评价基本原理和方法》。', '生物科学与工程学院', '闲置', '123456', '', 1),
(6, 8, 6, 7, 8, 1, 15, '教授', '卢钟磊', '研究方向:肿瘤生物学、细胞周期调控与信号转导。首次发现E2F1从“促增殖”向“促凋亡”转变的分子开关Skp2,并阐明其作用机制。', '肿瘤生物学', '出战', '350122', '', 2),
(7, 8, 7, 6, 7, 1, 15, '教授', '吴波', '多尺度集成计算材料工程,金属材料和无机功能材料的微结构、相变和性能研究，特种加工过程模拟仿真,特种新材料开发。研究课题选题广泛,开放包容性强。', '材料科学与工程学院', '出战', '350122', '', 2),
(5, 5, 5, 5, 5, 1, 15, '副教授', '壮年的栋哥', '一个很帅的老师', '软件工程', '出战', '350122', '', 1),
(7, 8, 7, 5, 8, 1, 15, '教授', '张旭东', '福建省法学会行为法学研究会会长,中国民事诉讼法学研究会理事,福建省诉讼法学研究会常务理事。', '法学院', '出战', '350122', '', 2),
(5, 5, 5, 5, 5, 1, 0, '教授', '张栋', '一个很帅的老师', '软件工程', '闲置', '350122', '', 2),
(6, 8, 6, 7, 8, 1, 0, '教授', '张鹰', '主要研究方向:城市设计理论与方法、城镇历史文化街区保护、乡村传统聚落保护与再生、传统建筑修缮技艺研究等。', '建筑与城乡规划学院', '闲置', '350122', '', 1),
(6, 7, 7, 5, 5, 1, 0, '副教授', '林海英', '具备十几年的教学经验,主要授课课程:《药物生物技术》、《免疫学》和《病原微生物和免疫学》等。', '生物科学与工程学院', '闲置', '350122', '', 1),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋2', '一个很帅的老师', '软件工程', '闲置', '350122', '', 3),
(5, 5, 5, 5, 4, 1, 0, '教授', '栋哥', '一个很帅的老师', '软件工程', '闲置', '350122', '', 1),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋大哥', '一个很帅的老师', '软件工程', '闲置', '350122', '', 2),
(7, 7, 6, 7, 8, 1, 0, '教授', '毛景文', '现任自然资源部成矿作用和资源评价重点实验室主任。兼任中国地质学会理事及矿床专业委员会主任,中国矿物岩石地球化学学会常务理事。', '紫金地质与矿业学院', '闲置', '350122', '', 3),
(8, 7, 6, 8, 6, 1, 0, '教授', '花为', '国家杰青、优青获得者,入选教育部青年长江学者、科技部中青年科技创新领军人才、中组部万人计划科技创新领军人才。', '电气工程', '闲置', '350122', '', 1),
(6, 7, 5, 5, 7, 1, 0, '副教授', '邓丽萍', '研究方向:金属材料结构设计及组织性能分析,金属材料强韧化机理研究。', '机械工程及自动化学院', '闲置', '350122', '', 1),
(7, 6, 7, 7, 8, 1, 0, '教授', '郭昆', '数字福建大数据基础技术福州研究院副院长,中国计算机学会CCF高级会员,CCF协同计算专委会委员,CCF大数据专委会委员。', '计算机与大数据学院', '闲置', '350122', '', 1),
(6, 7, 6, 4, 7, 1, 0, '副教授', '陆文彬', '研究方向:民商法学、经济法学、环境与资源保护法学。。', '法学院', '闲置', '350122', '', 1),
(7, 8, 6, 6, 8, 1, 0, '教授', '陈学明', '研究方向:污水生物处理水处理,工艺的数学模拟,新型微生物脱氮工艺,污水处理工艺的温室气体排放及减排,生物膜工艺', '环境与安全工程学院', '闲置', '350122', '', 4),
(6, 7, 7, 5, 5, 1, 0, '副教授', '陈文锋', '参与承担研究生课程《细胞生物学》、《细胞与基因工程》、《细胞信号转导》、本科生《生物化学实验》教学。', '生物科学与工程学院', '闲置', '350122', '', 1),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马妍', '主要研究方向:以资源环境为切入点,以计算机技术和城市模拟为基础,遵循驱动要素-个体行为-空间格局变化-空间管理的研究思路。', '建筑与城乡规划学院', '闲置', '350122', '', 1),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马非', '主要研究方向:公共建筑设计。科研项目:武夷山茶博物馆,福建武夷山。', '建筑与城乡规划学院', '闲置', '350122', '', 1),
(5, 5, 5, 5, 5, 1, 0, '教授', '栋哥', '一个很帅又幽默的老师', '软件工程', '闲置', '6666661', '2022-11-4', 1),
(6, 7, 6, 5, 6, 1, 0, '副教授', '严锴', '研究方向:算子理论与算子代数,线性算子谱理论与广义逆理论,算子空间、算子系统及相关的量子信息理论。', '数学与统计学院', '闲置', '6666666', '32131', 2),
(5, 5, 5, 5, 5, 1, 0, '副教授', '壮年的栋哥', '一个很帅的老师', '软件工程', '闲置', '6666666', '', 8),
(5, 5, 5, 5, 5, 1, 0, '讲师', '天才栋哥', '一个很帅的老师', '软件工程', '闲置', '6666666', '', 1),
(5, 5, 5, 5, 5, 3, 0, '教授', '张栋', '一个很帅又幽默的老师', '软件工程', '闲置', '6666666', '2022-11-4', 1),
(6, 6, 4, 5, 4, 1, 0, '讲师', '朱振山', '主要研究电力系统运行与控制,电力系统规划、人工智能在电力系统中的应用、储能等。', '电气工程', '闲置', '6666666', '', 2),
(5, 7, 4, 5, 4, 1, 0, '讲师', '杨晶菁', '主要研究方向包括电力电子功率变换技术、无线电能传输技术等。在国内外著名学术刊物和国际会议发表论文10篇。', '电气工程', '闲置', '6666666', '', 1),
(7, 8, 6, 4, 5, 1, 0, '副教授', '毛行奎', '研究领域包括电力电子电磁技术、电磁干扰诊断与抑制、功率变换技术,无线电能传输以及可再生能源发电等技术。', '电气工程', '闲置', '6666666', '', 16),
(6, 5, 6, 7, 6, 1, 0, '副教授', '洪艳梅', '主要研究领域为图论及其应用,组合最优化。主要包括结构图论,图算法,优化方面的理论和应用研究。', '数学与统计学院', '闲置', '6666666', '', 4),
(7, 7, 5, 6, 5, 1, 0, '副教授', '郑昕', '主要研究方向为电器及其智能化技术、开关电弧与等离子体。作为项目负责人,承担了福建省自然科学基金和福建省教育厅等多项省市级科技项目。', '电气工程', '闲置', '6666666', '', 10),
(6, 7, 6, 5, 6, 1, 0, '副教授', '严锴', '研究方向:算子理论与算子代数,线性算子谱理论与广义逆理论,算子空间、算子系统及相关的量子信息理论。', '算子理论', '闲置', '668877', '', 4),
(4, 6, 4, 5, 6, 1, 0, '讲师', '刘宝谨', '主要研究电力电子与电力传动,基于分布式多变流器的微电网控制技术,可再生能源并网,储能变流器.', '微电网控制，电子电力', '闲置', '668877', '', 1),
(6, 5, 6, 6, 7, 1, 0, '副教授', '刘耿耿', '博士生导师,旗山学者,福建省高层次人才,福州大学计算机与大数据学院院长助理,福建省网络计算与智能信息处理重点实验室副主任。', '大数据计算，智能信息处理', '闲置', '668877', '', 6),
(6, 6, 6, 5, 7, 1, 0, '副教授', '叶晓丹', '研究方向:经济法学、环境法学、税法学、金融法学。', '经济法学，环境法学', '闲置', '668877', '', 2),
(6, 5, 7, 7, 5, 1, 0, '副教授', '吕源财', '研究方向:环境友好材料的研发和应用,水污染控制化学,纳米材料的环境风险。', '环境与安全工程学院', '闲置', '668877', '', 4),
(5, 5, 5, 5, 5, 1, 0, '副教授', '壮年的栋哥', '一个很帅的老师', '软件工程', '闲置', '668877', '', 2),
(5, 5, 5, 5, 5, 1, 0, '讲师', '天才栋哥', '一个很帅的老师', '软件工程', '闲置', '668877', '', 1),
(5, 7, 5, 6, 7, 1, 0, '副教授', '张文慧', '主讲本科生《地球化学》、《同位素地球化学》及研究生《岩石矿床地球化学》等课程,承担永安地质教学实习课程。', '紫金地质与矿业学院', '闲置', '668877', '', 6),
(4, 6, 4, 5, 6, 1, 0, '讲师', '晏全香', '研究方向:选矿工艺,矿物材料,非金属深加工,资源综合利用。', '紫金地质与矿业学院', '闲置', '668877', '', 1),
(6, 6, 4, 5, 4, 1, 0, '讲师', '朱振山', '主要研究电力系统运行与控制,电力系统规划、人工智能在电力系统中的应用、储能等。', '电气工程', '闲置', '668877', '', 1),
(5, 7, 4, 5, 4, 1, 0, '讲师', '杨晶菁', '主要研究方向包括电力电子功率变换技术、无线电能传输技术等。在国内外著名学术刊物和国际会议发表论文10篇。', '电气工程', '闲置', '668877', '', 1),
(5, 5, 5, 5, 5, 1, 0, '讲师', '林木森', '主讲“普通地质学”、“区域地质学”、“高级岩石学”、“地质认识实习”等课程。', '紫金地质与矿业学院', '闲置', '668877', '', 1),
(7, 5, 5, 6, 7, 1, 0, '副教授', '林枞', '研究方向:功能陶瓷、陶瓷先进成型与烧结技术、材料高通量制备。', '材料科学与工程学院', '闲置', '668877', '', 6),
(6, 7, 7, 5, 5, 1, 0, '副教授', '林海英', '具备十几年的教学经验,主要授课课程:《药物生物技术》、《免疫学》和《病原微生物和免疫学》等。', '生物科学与工程学院', '闲置', '668877', '', 1),
(7, 8, 6, 4, 5, 1, 0, '副教授', '毛行奎', '研究领域包括电力电子电磁技术、电磁干扰诊断与抑制、功率变换技术,无线电能传输以及可再生能源发电等技术。', '电气工程', '闲置', '668877', '', 9),
(6, 5, 6, 7, 6, 1, 0, '副教授', '洪艳梅', '主要研究领域为图论及其应用,组合最优化。主要包括结构图论,图算法,优化方面的理论和应用研究。', '数学与统计学院', '闲置', '668877', '', 5),
(5, 5, 5, 6, 4, 1, 0, '讲师', '王成勇', '主要从事水泥及混凝土等建筑材料的相关科研:包括混凝土外加剂、干混砂浆、新型墙体材料、废旧混凝土等建筑废料的开发利用。', '材料科学与工程学院', '闲置', '668877', '', 2),
(6, 6, 5, 6, 7, 1, 0, '副教授', '肖爱芳', '主讲《地质制图》、《资源信息工程》、《地质制图课程设计》、《资源信息工程课程设计》、《数字矿山》等课程。', '紫金地质与矿业学院', '闲置', '668877', '', 3),
(6, 5, 7, 7, 5, 1, 0, '副教授', '肖蓉', '研究方向:退化盐沼湿地淡水补水修复的土壤响应机理,污染物在湿地土壤中的迁移转化机制及污染生态风险评价。', '环境与安全工程学院', '闲置', '668877', '', 4),
(6, 7, 7, 6, 4, 1, 0, '副教授', '萨百晟', '研究方向:基于材料基因工程的材料多尺度集成模拟与设计、密度泛函理论材料自动流程计算、机器学习材料性质预测。', '材料科学与工程学院', '闲置', '668877', '', 8),
(5, 6, 5, 5, 4, 1, 0, '讲师', '蔡芫镔', '主讲课程:城市生态学、环境规划与管理、景观生态学及其应用、环境水文学。', '环境与安全工程学院', '闲置', '668877', '', 1),
(4, 6, 4, 5, 6, 1, 0, '讲师', '薛林', '主要研究方向:乡土文化景观研究，景观美学。', '建筑与城乡规划学院', '闲置', '668877', '', 1),
(6, 7, 5, 5, 7, 1, 0, '副教授', '邓丽萍', '研究方向:金属材料结构设计及组织性能分析,金属材料强韧化机理研究。', '机械工程及自动化学院', '闲置', '668877', '', 8),
(7, 7, 5, 6, 5, 1, 0, '副教授', '郑昕', '主要研究方向为电器及其智能化技术、开关电弧与等离子体。作为项目负责人,承担了福建省自然科学基金和福建省教育厅等多项省市级科技项目。', '电气工程', '闲置', '668877', '', 2),
(4, 6, 4, 5, 6, 1, 0, '讲师', '郑琦珊', '主要研究方向:校园建筑设计、公共建筑设计及其更新改造研究、保障性住房设计及其适老化改造研究、建筑设计教学改革。', '建筑与城乡规划学院', '闲置', '668877', '', 1),
(6, 7, 6, 4, 7, 1, 0, '副教授', '陆文彬', '研究方向:民商法学、经济法学、环境与资源保护法学。。', '法学院', '闲置', '668877', '', 7),
(6, 7, 5, 5, 7, 1, 0, '副教授', '陈彦杰', '研究方向:运动规划、路径规划,机器人运动学和动力学,智能控制方法,智能优化方法。', '机械工程及自动化学院', '闲置', '668877', '', 7),
(6, 7, 7, 5, 5, 1, 0, '副教授', '陈文锋', '参与承担研究生课程《细胞生物学》、《细胞与基因工程》、《细胞信号转导》、本科生《生物化学实验》教学。', '生物科学与工程学院', '闲置', '668877', '', 6),
(7, 5, 5, 6, 7, 1, 0, '副教授', '陈道也', '中国计算机学会CCF会员,中国地理学会GSC会员,美国哈佛大学兼职研究员Research Associate。', '计算机与大数据学院', '闲置', '668877', '', 3),
(5, 5, 6, 4, 6, 1, 0, '讲师', '韩京京', '研究方向:民法、比较法、法国法。', '法学院', '闲置', '668877', '', 1),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马妍', '主要研究方向:以资源环境为切入点,以计算机技术和城市模拟为基础,遵循驱动要素-个体行为-空间格局变化-空间管理的研究思路。', '建筑与城乡规划学院', '闲置', '668877', '', 7),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马非', '主要研究方向:公共建筑设计。科研项目:武夷山茶博物馆,福建武夷山。', '建筑与城乡规划学院', '闲置', '668877', '', 5),
(6, 7, 6, 5, 6, 1, 0, '副教授', '严锴', '研究方向:算子理论与算子代数,线性算子谱理论与广义逆理论,算子空间、算子系统及相关的量子信息理论。', '数学与统计学院', '出战', '679817', '', 9),
(5, 6, 4, 5, 5, 1, 0, '讲师', '刘金艳', '主讲课程:生物冶金基础、选矿测试技术训练。', '生物治金，选矿', '闲置', '679817', '', 1),
(6, 5, 7, 7, 5, 1, 0, '副教授', '吕源财', '研究方向:环境友好材料的研发和应用,水污染控制化学,纳米材料的环境风险。', '环境与安全工程学院', '出战', '679817', '', 1),
(5, 5, 5, 5, 5, 1, 0, '讲师', '天才栋哥', '一个很帅的老师', '软件工程', '闲置', '679817', '', 1),
(5, 5, 5, 6, 4, 1, 0, '讲师', '常卫杰', '研究领域:集成光电子技术与器件研究,光子器件智能优化与逆向设计。', '机械工程及自动化学院', '闲置', '679817', '', 1),
(5, 7, 5, 6, 7, 1, 0, '副教授', '张文慧', '主讲本科生《地球化学》、《同位素地球化学》及研究生《岩石矿床地球化学》等课程,承担永安地质教学实习课程。', '紫金地质与矿业学院', '闲置', '679817', '', 1),
(5, 5, 5, 5, 5, 1, 0, '讲师', '林木森', '主讲“普通地质学”、“区域地质学”、“高级岩石学”、“地质认识实习”等课程。', '紫金地质与矿业学院', '闲置', '679817', '', 1),
(7, 5, 5, 6, 7, 1, 0, '副教授', '林枞', '研究方向:功能陶瓷、陶瓷先进成型与烧结技术、材料高通量制备。', '材料科学与工程学院', '出战', '679817', '', 3),
(6, 5, 6, 4, 4, 1, 0, '讲师', '檀彦超', '研究兴趣包括推荐系统、智慧医疗、数据挖掘、人工智能、机器学习等。曾在KDD、SIGIR、ICDE等CCF A类会议上发表了多篇学术论文。', '计算机与大数据学院', '闲置', '679817', '', 2),
(6, 5, 6, 7, 6, 1, 0, '副教授', '洪艳梅', '主要研究领域为图论及其应用,组合最优化。主要包括结构图论,图算法,优化方面的理论和应用研究。', '数学与统计学院', '出战', '679817', '', 13),
(5, 5, 5, 6, 4, 1, 0, '讲师', '王大彪', '研究方向:超临界流体在强化管内的对流换热,有机朗肯循环动力系统设计。', '机械工程及自动化学院', '闲置', '679817', '', 1),
(5, 4, 6, 5, 5, 1, 0, '讲师', '王平', '目前从事代数方向研究,主讲课程:高等数学,线性代数等。', '数学与统计学院', '出战', '679817', '', 2),
(5, 5, 5, 6, 4, 1, 0, '讲师', '王成勇', '主要从事水泥及混凝土等建筑材料的相关科研:包括混凝土外加剂、干混砂浆、新型墙体材料、废旧混凝土等建筑废料的开发利用。', '材料科学与工程学院', '闲置', '679817', '', 1),
(5, 5, 5, 5, 5, 1, 0, '讲师', '王鹏', '主要从事切换系统控制、正系统的性能分析与综合、人工神经网络、动力系统的稳定性分析与控制等领域的研究。', '数学与统计学院', '闲置', '679817', '', 1),
(6, 6, 5, 6, 7, 1, 0, '副教授', '肖爱芳', '主讲《地质制图》、《资源信息工程》、《地质制图课程设计》、《资源信息工程课程设计》、《数字矿山》等课程。', '紫金地质与矿业学院', '出战', '679817', '', 4),
(6, 5, 7, 7, 5, 1, 0, '副教授', '肖蓉', '研究方向:退化盐沼湿地淡水补水修复的土壤响应机理,污染物在湿地土壤中的迁移转化机制及污染生态风险评价。', '环境与安全工程学院', '出战', '679817', '', 3),
(6, 7, 7, 6, 4, 1, 60, '副教授', '萨百晟', '研究方向:基于材料基因工程的材料多尺度集成模拟与设计、密度泛函理论材料自动流程计算、机器学习材料性质预测。', '材料科学与工程学院', '闲置', '679817', '1670951876933', 3),
(5, 6, 5, 5, 4, 1, 0, '讲师', '蔡芫镔', '主讲课程:城市生态学、环境规划与管理、景观生态学及其应用、环境水文学。', '环境与安全工程学院', '闲置', '679817', '', 2),
(4, 6, 4, 5, 6, 1, 0, '讲师', '薛林', '主要研究方向:乡土文化景观研究，景观美学。', '建筑与城乡规划学院', '闲置', '679817', '', 2),
(6, 7, 5, 5, 7, 1, 0, '副教授', '邓丽萍', '研究方向:金属材料结构设计及组织性能分析,金属材料强韧化机理研究。', '机械工程及自动化学院', '闲置', '679817', '', 2),
(7, 7, 5, 6, 5, 1, 0, '副教授', '郑昕', '主要研究方向为电器及其智能化技术、开关电弧与等离子体。作为项目负责人,承担了福建省自然科学基金和福建省教育厅等多项省市级科技项目。', '电气工程', '闲置', '679817', '', 8),
(4, 6, 4, 5, 6, 1, 0, '讲师', '郑琦珊', '主要研究方向:校园建筑设计、公共建筑设计及其更新改造研究、保障性住房设计及其适老化改造研究、建筑设计教学改革。', '建筑与城乡规划学院', '闲置', '679817', '', 2),
(7, 6, 7, 7, 8, 1, 0, '教授', '郭昆', '数字福建大数据基础技术福州研究院副院长,中国计算机学会CCF高级会员,CCF协同计算专委会委员,CCF大数据专委会委员。', '计算机与大数据学院', '闲置', '679817', '', 1),
(5, 5, 5, 4, 6, 1, 0, '讲师', '陈哲毅', '福建省网络计算与智能信息处理重点实验室副主任,主要研究方向包括云/边缘计算、资源优化、深度学习、强化学习等。', '计算机与大数据学院', '闲置', '679817', '', 1),
(6, 7, 5, 5, 7, 1, 0, '副教授', '陈彦杰', '研究方向:运动规划、路径规划,机器人运动学和动力学,智能控制方法,智能优化方法。', '机械工程及自动化学院', '出战', '679817', '', 3),
(6, 7, 7, 5, 5, 1, 0, '副教授', '陈文锋', '参与承担研究生课程《细胞生物学》、《细胞与基因工程》、《细胞信号转导》、本科生《生物化学实验》教学。', '生物科学与工程学院', '出战', '679817', '', 3),
(7, 5, 5, 6, 7, 1, 0, '副教授', '陈道也', '中国计算机学会CCF会员,中国地理学会GSC会员,美国哈佛大学兼职研究员Research Associate。', '计算机与大数据学院', '出战', '679817', '', 3),
(5, 5, 6, 4, 6, 1, 0, '讲师', '韩京京', '研究方向:民法、比较法、法国法。', '法学院', '闲置', '679817', '', 1),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马妍', '主要研究方向:以资源环境为切入点,以计算机技术和城市模拟为基础,遵循驱动要素-个体行为-空间格局变化-空间管理的研究思路。', '建筑与城乡规划学院', '出战', '679817', '', 5),
(5, 7, 5, 6, 7, 1, 0, '副教授', '马非', '主要研究方向:公共建筑设计。科研项目:武夷山茶博物馆,福建武夷山。', '建筑与城乡规划学院', '出战', '679817', '', 1),
(5, 5, 6, 4, 5, 1, 0, '讲师', '黄寿颖', '主讲课程:高等数学、数学建模、线性代数。研究生物数学。', '数学与统计学院', '闲置', '679817', '', 1);

-- --------------------------------------------------------

--
-- 表的结构 `personaltask`
--

CREATE TABLE IF NOT EXISTS `personaltask` (
  `taskname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `date` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `current` int DEFAULT NULL,
  `end` int DEFAULT NULL,
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `reward` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `UID` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `personaltask`
--

INSERT INTO `personaltask` (`taskname`, `date`, `current`, `end`, `type`, `reward`, `UID`) VALUES
('派遣十五次', '2022-12-13', 0, 3, '周常', '金钱100', '350122'),
('进行1句对局', '2022-11-18', 0, 1, '日常', '500金币', '123456'),
('进行10句对局', '2022-12-13', 3, 5, '日常', '500金币', '350122'),
('进行1句对局', '2022-11-18', 0, 1, '每日', '500金币', '123456');

-- --------------------------------------------------------

--
-- 表的结构 `question`
--

CREATE TABLE IF NOT EXISTS `question` (
  `questionAbility1` float DEFAULT NULL,
  `questionAbility2` float DEFAULT NULL,
  `questionAbility3` float DEFAULT NULL,
  `questionAbility4` float DEFAULT NULL,
  `questionAbility5` float DEFAULT NULL,
  `questionName` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `preferance` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `question`
--

INSERT INTO `question` (`questionAbility1`, `questionAbility2`, `questionAbility3`, `questionAbility4`, `questionAbility5`, `questionName`, `preferance`) VALUES
(4, 3, 5, 1, 2, 'AI绘画', '机器学习'),
(0, 6, 14, 0, 0, '数据结构', '计算机'),
(1, 7, 10, 1, 1, '机器学习', '计算机'),
(0, 15, 0, 0, 5, '离散数学', '数学'),
(0, 11, 4, 0, 5, '线性代数', '数学'),
(4, 3, 5, 1, 2, '蛋白质折叠', '生物计算机'),
(2, 5, 8, 1, 4, '软件工程', '计算机'),
(1, 14, 3, 0, 2, '高等数学', '数学'),
(0, 10, 10, 0, 0, '高级程序设计', '计算机');

-- --------------------------------------------------------

--
-- 表的结构 `rank`
--

CREATE TABLE IF NOT EXISTS `rank` (
  `collegeInfluence` int DEFAULT NULL,
  `grade` int DEFAULT NULL,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `rank` int DEFAULT NULL,
  `college` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `dateTime` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `rank`
--

INSERT INTO `rank` (`collegeInfluence`, `grade`, `name`, `rank`, `college`, `dateTime`) VALUES
(100, 990, '李福安', 1, '计算机学院', '2022-07-04 00:00:00'),
(0, 100, '牛魔王', 2, '计算机与大数据学院', NULL),
(50, 90, '用户123', 3, '计算机与大数据学院', '2022-11-4');

-- --------------------------------------------------------

--
-- 表的结构 `task`
--

CREATE TABLE IF NOT EXISTS `task` (
  `taskname` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `current` int DEFAULT NULL,
  `end` int DEFAULT NULL,
  `type` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `reward` varchar(300) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `date` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `task`
--

INSERT INTO `task` (`taskname`, `current`, `end`, `type`, `reward`, `date`) VALUES
('任意派遣三次', 0, 3, '每日', '500金币', '2022-11-18'),
('完成40局对局', 0, 40, '每周', '2500金币', '2022-11-18'),
('抽卡一次', 0, 1, '每日', '100金币', '2022-11-18'),
('派遣老师完成4次科研', 0, 4, '每周', '5000金币', '2022-11-18'),
('派遣老师完成教学7次', 0, 7, '每周', '2000金币', '2022-11-18'),
('累积爬塔1层', 0, 1, '每日', '100金币', '2022-11-18'),
('累积爬塔5层', 0, 5, '每周', '1500金币', '2022-11-18'),
('进行5局对局', 0, 5, '每日', '500金币', '2022-11-18');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `collegeInfluence` int DEFAULT NULL,
  `coin` int DEFAULT NULL,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `password` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `college` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `phoneNumber` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `UID` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `dateTime` datetime(6) DEFAULT NULL,
  `towerNumber` int DEFAULT '0',
  `sex` enum('男','女') CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `battle` int NOT NULL DEFAULT '0',
  `win` int NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`collegeInfluence`, `coin`, `name`, `password`, `college`, `phoneNumber`, `UID`, `dateTime`, `towerNumber`, `sex`, `battle`, `win`) VALUES
(0, 0, '123', '213', '计算机与大数据学院', '00000000000', '', '0000-00-00 00:00:00.000000', 0, '女', 0, 0),
(100, 1009, '李福安', '123456', '计算机学院', '13110635554', '032002', '2022-11-14 00:00:00.000000', 66, '女', 0, 0),
(100, 999, '李福安', '123456', '计算机学院', '13110635554', '123456', '2022-11-14 00:00:00.000000', 66, '男', 0, 0),
(10401, 11480, '牛魔王', '213', '计算机与大数据学院', '00000000000', '350122', '2022-12-13 00:00:00.000000', 15, '男', 12, 5),
(100, 999, '王一', '123456', '计算机学院', '13110635554', '6666661', '2022-11-14 00:00:00.000000', 66, '男', 0, 0),
(100, 999, '李福安', '123456', '计算机学院', '13110635554', '6666666', '2022-11-14 00:00:00.000000', 66, '男', 0, 0),
(99999999, 99999999, '李福安', '123456', '计算机学院', '13110677554', '667897', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(100, 999, '李福安', '123456', '计算机学院', '13110677554', '668866', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(1000000, 999, '李福安', '123456', '计算机学院', '13110677554', '668867', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(1000000000, 999, '李福安', '123456', '计算机学院', '13110677554', '668877', '2022-07-04 00:00:00.000000', 99, '女', 0, 0),
(99999999, 99999999, '阿萨德欧昂倒计时拉加德拉康绝地欧文去奇偶丘吉尔', '123456', '计算机学院', '13110677554', '669897', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(0, 0, '昵称', '213', '计算机与大数据学院', '00000000000', '6698971', '0000-00-00 00:00:00.000000', 0, '男', 0, 0),
(2499, 4000, '李福安', '123456', '计算机学院', '13110677554', '679817', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(99999999, 99999999, '阿萨德欧昂倒计时拉加德拉康绝地欧文去奇尔地欧偶丘吉尔地欧文去奇偶丘吉尔地奇偶丘吉尔地欧文去奇偶丘吉尔', '123456dasdsadsadsaczvcvccxqweqw', '计算机学院', '13110677554', '777017', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(99999999, 99999999, '阿萨德欧昂倒计时拉加德拉康绝地欧文去奇尔地欧偶丘吉尔地欧文去奇偶丘吉尔地奇偶丘吉尔地欧文去奇偶丘吉尔', '123456dasdsadsadsaczvcvccxqweqw', '计算机学院', '13110677554', '77717', '2022-07-04 00:00:00.000000', 99, '男', 0, 0),
(100, 100, '李福安', '123456', '计算机学院', '13110677554', '778077', '2022-12-12 00:00:00.000000', 222, '男', 0, 0),
(100, 100, '李福安', '123456', '计算机学院', '13110677554', '778777', '2022-12-12 00:00:00.000000', 500, '男', 0, 0),
(100, 100, '李福安', '123456', '计算机学院', '13110677554', '778778', '2022-12-12 00:00:00.000000', 50000000, '男', 0, 0),
(0, 0, '用户123', '123456', '计算机与大数据学院', '00000000000', 'ovJsv5m5LDi_u_06fG8K_gc03TBU', NULL, 0, '男', 0, 0),
(0, 0, '用户123', '123456', '计算机与大数据学院', '00000000000', 'ovJsv5tiyh44GxArR5oGPJV8GzKA', NULL, 0, '男', 0, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `card`
--
ALTER TABLE `card`
  ADD PRIMARY KEY (`cardName`);

--
-- Indexes for table `personalcard`
--
ALTER TABLE `personalcard`
  ADD PRIMARY KEY (`UID`,`cardName`),
  ADD KEY `personalcard_cardName` (`cardName`);

--
-- Indexes for table `personaltask`
--
ALTER TABLE `personaltask`
  ADD PRIMARY KEY (`type`,`UID`),
  ADD KEY `personaltask_UID` (`UID`);

--
-- Indexes for table `question`
--
ALTER TABLE `question`
  ADD PRIMARY KEY (`questionName`);

--
-- Indexes for table `rank`
--
ALTER TABLE `rank`
  ADD PRIMARY KEY (`name`);

--
-- Indexes for table `task`
--
ALTER TABLE `task`
  ADD PRIMARY KEY (`taskname`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`UID`),
  ADD KEY `name` (`name`);

--
-- 限制导出的表
--

--
-- 限制表 `personalcard`
--
ALTER TABLE `personalcard`
  ADD CONSTRAINT `personalcard_cardName` FOREIGN KEY (`cardName`) REFERENCES `card` (`cardName`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  ADD CONSTRAINT `personalcard_UID` FOREIGN KEY (`UID`) REFERENCES `user` (`UID`) ON DELETE RESTRICT ON UPDATE RESTRICT;

--
-- 限制表 `personaltask`
--
ALTER TABLE `personaltask`
  ADD CONSTRAINT `personaltask_UID` FOREIGN KEY (`UID`) REFERENCES `user` (`UID`) ON DELETE RESTRICT ON UPDATE RESTRICT;

--
-- 限制表 `rank`
--
ALTER TABLE `rank`
  ADD CONSTRAINT `rank_name` FOREIGN KEY (`name`) REFERENCES `user` (`name`) ON DELETE RESTRICT ON UPDATE RESTRICT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
